{"slug":"elixir","title":"elixir","description":"Curated elixir","createdAt":"2024-05-31T19:23:52.000Z","items":[{"url":"https://underjord.io/chattanooga-gigcityelixir-nervesconf-2024.html?utm_source=elixir-merge","title":"Chatting, Sharing (& Shots) in Chattanooga - GigCity 2024 report","excerpt":"Underjord is a tiny, wholesome team doing Elixir consulting and contract work. If you like the writing you should really try the code. See our services for more information. I went to Chattanooga in Tennessee from Sweden to hang out with the Elixir community.","note":null},{"url":"https://www.milanvit.net/post/making-my-dumb-a-c-smart-with-elixir-and-nerves/?utm_source=elixir-merge","title":"Making my dumb A/C smart with Elixir and Nerves","excerpt":"As the scorching Japanese summer creeps ever closer with each passing day, I kept thinking about my yesteryear idea of remotely controlling my bedroom A/C over the Internet.","note":null},{"url":"https://www.elixirstreams.com/tips/erlang-new-json-module?utm_source=elixir-merge","title":"Erlang ❤️ JSON","excerpt":"Erlang 27 just came out, and one of the highlights is the new built-in :json module! Voilà! JSON encoding and decoding straight out of the box!","note":null},{"url":"https://underjord.io/the-future-stack.html?utm_source=elixir-merge","title":"The Future Stack","excerpt":"Underjord is a tiny, wholesome team doing Elixir consulting and contract work. If you like the writing you should really try the code. See our services for more information. Fly.io is a highly visible cloud provider in the Elixir ecosystem and they put forward an interesting promise.","note":null},{"url":"https://www.elixirstreams.com/tips/richer-domain-types-with-ecto-custom-types?utm_source=elixir-merge","title":"Richer domain types with Ecto custom types","excerpt":"Primitive obsession makes our codebases harder to deal with. Thankfully, Ecto custom types can help us transform primitives (or native types) into domain structures more quickly and at the boundary!","note":null},{"url":"https://fly.io/phoenix-files/elixir-and-phoenix-can-do-it-all/","title":"Elixir and Phoenix can do it all!","excerpt":"We’re Fly.io. We run apps for our users on hardware we host around the world. Fly.io happens to be a great place to run Phoenix applications. Check out how to get started!","note":null},{"url":"https://erick.navarro.io/blog/simple-obs-client-in-elixir/?utm_source=elixir-merge","title":"Simple OBS Client in Elixir","excerpt":"Let's write a simple module to control OBS using websockets. OBS already have a websocket server which can accept many command to control its features. We're going to use that websocket server to make some actions like: Change scene Apply source filters Many other things Basic configuration First we need to install a websocket client, fresh is a easy to use client that works on top on mint. Let's add the following code to our mix.","note":null},{"url":"https://kobrakai.de/kolumne/bare-websockets?utm_source=elixir-merge","title":"Bare Websockets","excerpt":"While phoenix used websocket connections for a long time for its Phoenix.Channel abstraction there wasn’t really a good way to use websocket directly up until phoenixs latest major release (1.7).","note":null},{"url":"https://www.chriis.dev/opinion/implementing-google-authentication-in-a-liveview-application?utm_source=elixir-merge","title":"Implementing Google Authentication in a LiveView Application","excerpt":"If you’re an Elixir developer and you’ve created a new Phoenix LiveView application in the last few years then you’ve likely come across the excellent authentication generator that ships out of the box with Phoenix.","note":null},{"url":"https://lambdaland.org/posts/2024-05-01_definitely_not_about_monads/?utm_source=elixir-merge","title":"Boilerplate Busting in Functional Languages","excerpt":"This is the story of how I solved a problem (ugly, cumbersome boilerplate code) that I ran into while writing a program in a functional language (Elixir).","note":null},{"url":"https://onor.io/2024/05/07/least-privilege-and-elixir-ecto/?utm_source=elixir-merge","title":"Least Privilege And Elixir Ecto","excerpt":"What’s Least Privilege? Before diving in to the heart of this blog post I think it’s wise to explain what I mean by “Least Privilege” and why it’s worth while. I think it’s also worth discussing why you may not want to bother with it as well.","note":null},{"url":"https://cahoots.pl/#Phoenix%20auth%20in%202024%3A%20provider%20auth","title":"#Phoenix%20auth%20in%202024%3A%20provider%20auth","excerpt":null,"note":null},{"url":"https://curiosum.com/blog/segregate-responsibilities-with-elixir-commanded?utm_source=elixir-merge","title":"Segregate Responsibilities with Elixir Commanded","excerpt":"Explore how Elixir's Commanded library revolutionizes application development through CQRS and Event Sourcing, offering powerful capabilities for audit, time travel, and seamless event-driven architecture.","note":null},{"url":"https://www.elixirstreams.com/tips/tap-and-then-helpers?utm_source=elixir-merge","title":"2 Helpers to Keep Your Pipelines Flowing! 😎","excerpt":"Elixir code tends to be pipe-friendly. But sometimes that fails. You have a pesky break in your pipeline! Here are 2 helpers that can help you keep your pipeline flowing!","note":null},{"url":"https://indiecourses.com/blog/full-text-search-with-pgroonga-and-postgres?utm_source=elixir-merge","title":"full-text-search-with-pgroonga-and-postgres?utm_source=elixir-merge","excerpt":null,"note":null},{"url":"https://johnelmlabs.com/posts/pdf-behind-authentication?utm_source=elixir-merge","title":"How to Generate a PDF on a Page Behind Auth in Elixir","excerpt":"The request is inevitable: “The client wants to be able to download a PDF of this page”. PDF generation woes aside, this particular request is extra problematic because the page the customer wants to download is behind authentication.","note":null},{"url":"https://blog.jasonkaniekete.fr/how-to-handle-file-uploads-using-trix-editor-in-a-phoenix-application/?utm_source=elixir-merge","title":"How to handle file upload using Trix editor in a Phoenix application","excerpt":"In my quest of searching for a WYSIWYG editor, I came across Trix. An open-source rich text editor, easy to setup. Thanks to multiple ressources, I was able to set it up pretty quickly, however I didn't find anything regarding file uploads.","note":null},{"url":"https://peterullrich.com/handle-phoenix-exceptions-gracefully?utm_source=elixir-merge","title":"Handle Phoenix Exceptions gracefully","excerpt":"Hello there fellow Elixirists! It’s been a while since my last blog post which is largely the fault of my new startup indiecourses.com which takes up all my previous blog-writing time!","note":null},{"url":"https://danschultzer.com/posts/development-helpers-in-elixir?utm_source=elixir-merge","title":"Development helpers in Elixir","excerpt":"How do you efficiently set up development-only logic in Elixir? In one directory: _dev. This directory will contain all your development-only logic. Combined with config/dev.exs configuration, this makes a clear and safe separation from your production logic. There will be no need for awkward Mix.","note":null},{"url":"https://gaiety.life/tils/mac_sonoma_zsh_asdf_erlang_elixir/","title":"Resolving zsh bus error with erlang/elixir on Mac Sonoma with asdf","excerpt":null,"note":null},{"url":"https://fly.io/phoenix-files/easy-at-home-ai-with-bumblebee-and-fly-gpus/?utm_source=elixir-merge","title":"Easy at-home AI with Bumblebee and Fly GPUs","excerpt":"We’re Fly.io and we transmute containers into VMs, running them on our hardware around the world. We have fast booting VM’s and GPUs; so why not take advantage of them? A big barrier to getting started with local AI development is access to hardware.","note":null},{"url":"https://blog.sequin.io/liveview-is-best-with-svelte/","title":"LiveView is best with Svelte","excerpt":"Phoenix's LiveView has polarized our team. Compared to SPA, there are components and features that we’re able to build 2-3x faster. Conversely, there are components and features that are frustrating to build or feel very counterintuitive. Said another way, LiveView makes a lot of things easy.","note":null},{"url":"https://blog.appsignal.com/2024/04/02/how-to-use-flume-in-your-elixir-app.html?utm_source=elixir-merge","title":"How to Use Flume in your Elixir Application","excerpt":"As your Elixir app grows, you might need advanced control over how and where to perform background tasks or pull them off queues to manage back pressure. In this post, you will learn how to handle background jobs with Flume, a job processing system that uses GenStage and Redis.","note":null},{"url":"https://community.fly.io/t/how-can-i-use-ffmpeg-on-fly-io/4366","title":"How can I use ffmpeg on fly.io?","excerpt":"Assuming that whatever application using it is calling it like any Linux command you can add it to your Dockefile like so RUN apt-get install -y ffmpeg.","note":null},{"url":"https://dashbit.co/blog/req-api-client-testing","title":"Req API Client Testing","excerpt":"In recent discussions with one of our Elixir Development Subscription clients, the topic of HTTP API client testing came up. In this article we’ll walk through an imaginary third party API integration and discuss testing approaches and affordances provided by Req.","note":null},{"url":"https://optimum.ba/blog/optimum-elixir-ci-with-github-actions?utm_source=elixir-merge","title":"Optimum Elixir CI with GitHub Actions","excerpt":"Here’s yet another “ultimate Elixir CI” blog post. We haven’t had one for quite some time. But on a more serious note we have some unique ideas, so continue reading and I’m sure you’ll get some inspiration for your development workflows.","note":null},{"url":"https://www.thestackcanary.com/elixirs-secret-weapon/?utm_source=elixir-merge","title":"Livebook: Elixir's Swiss Army Knife","excerpt":"Recently I gave a talk about my first year programming with Elixir and my experience contributing to Elixir's open-source ecosystem. In it, I made some points about how a big part of encouraging language adoption is to reduce friction.","note":null},{"url":"https://dockyard.com/blog/2024/03/19/elixir-machine-learning-pre-trained-onnx-models-with-ortex?utm_source=elixir-merge","title":"Elixir Machine Learning: Using Pre-trained ONNX Models with Ortex","excerpt":"Your digital product has to stand out in a crowded marketplace. Elixir’s stability and scalability help you do that. Book a free consult today to learn how we can use it to help you outperform your competitors.","note":null},{"url":"https://phoenixonrails.com/blog/easy-empty-states-for-phoenix-liveview-streams-using-tailwind?utm_source=elixir-merge","title":"Easy empty states for Phoenix LiveView streams using Tailwind","excerpt":"Phoenix on Rails is a comprehensive guide to Elixir, Phoenix and LiveView for developers who already know Ruby on Rails. If you’re a Rails developer who wants to learn Phoenix fast, click here to learn more! Phoenix 1.","note":null},{"url":"https://gonglexin.com/posts/poker-face-part-1?utm_source=elixir-merge","title":"Creating Custom Stickers/Avatars from Your Webcam - Part 1","excerpt":"I’ve just made my new project, Poker Face, available as open-source. This project is crafted with Elixir and Phoenix LiveView. Its core features allow you to: Check out the introduction video here: In this blog series, I’ll guide you through every detail of the implementation.","note":null}]}