Repository: iagocavalcante/iago-cavalcante
Catalog: priv/gettext/*/LC_MESSAGES/errors.po
Languages: pt_br

source: can't be blank
pt_br: não pode ser vazio

source: has already been taken
pt_br: já está em uso

source: is invalid
pt_br: é inválido

source: must be accepted
pt_br: tem que ser aceito

source: has invalid format
pt_br: tem um formato inválido

source: has an invalid entry
pt_br: tem dados inválidos

source: is reserved
pt_br: é reservado

source: does not match confirmation
pt_br: não bate a confirmação

source: is still associated with this entry
pt_br: ainda está associado a esta entrada

source: are still associated with this entry
pt_br: ainda estão associados a esta entrada

source: should have %{count} item(s)
pt_br: deve ter %{count} item

source: should have at most %{count} item(s)
pt_br: deve ter ao menos %{count} item

source: should be at most %{count} character(s)
pt_br: deve ter ao menos %{count} caracter

source: should be at most %{count} byte(s)
pt_br: deve ter ao menos %{count} byte(s)

source: must be less than %{number}
pt_br: deve ser menor que %{number}

source: must be greater than %{number}
pt_br: deve ser maior que %{number}

source: must be less than or equal to %{number}
pt_br: deve ser menor igual à %{number}

source: must be greater than or equal to %{number}
pt_br: deve ser maior ou igual à %{number}

source: must be equal to %{number}
pt_br: tem que ser igual à %{number}
